###############################################################
#  Generated by:      Cadence Innovus 21.10-p004_1
#  OS:                Linux x86_64(Host ID localhost.localdomain)
#  Generated on:      Fri Feb  3 11:25:27 2023
#  Design:            i2c_master_top
#  Command:           route_design
###############################################################
current_design i2c_master_top
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {wb_clk_i}]  -name clk -period 8.000000 -waveform {0.000000 4.000000}
set_propagated_clock  [get_ports {wb_clk_i}]
