###############################################################
#  Generated by:      Cadence Innovus 21.10-p004_1
#  OS:                Linux x86_64(Host ID localhost.localdomain)
#  Generated on:      Fri Feb  3 11:38:25 2023
#  Design:            uart
#  Command:           route_design
###############################################################
current_design uart
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {sys_clk}]  -name clk -period 8.000000 -waveform {0.000000 4.000000}
set_propagated_clock  [get_ports {sys_clk}]
